In [1]:
import pandas as pd

In [2]:
data = "new_user_data.csv"
df = pd.read_csv(data)

In [3]:
print(df.shape) 
print(df.info())
display(df.head())

(917, 4)
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 917 entries, 0 to 916
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   age         917 non-null    int64
 1   gender      917 non-null    object
 2   occupation  917 non-null    object
 3   birth_year  917 non-null    int64
dtypes: int64(2), object(2)
memory usage: 28.8+ KB
None

   age gender occupation  birth_year
0    7      M    student        2017
1   10      M    student        2014
2   13      F    student        2011
3   13      M      other        2011
4   13      F    student        2011

In [4]:
df['gender'].value_counts()

gender
M    655
F    262
Name: count, dtype: int64

In [5]:
df.groupby('occupation')['age'].mean().sort_values(ascending=False)

occupation
retired          63.071429
doctor           43.571429
educator         41.914894
healthcare       41.000000
librarian        40.200000
administrator    39.026316
executive        38.718750
marketing        37.615385
lawyer           36.750000
engineer         36.703125
writer           36.311111
salesman         35.666667
scientist        35.548387
other            34.504854
technician       33.500000
programmer       33.265625
homemaker        32.571429
artist           31.392857
entertainment    29.222222
unknown          24.000000
student          22.020942
Name: age, dtype: float64

In [7]:
print(pd.crosstab(df['occupation'], df['gender'],margins=True))

gender           F    M  All
occupation
administrator   34   42   76
artist          13   15   28
doctor           0    7    7
educator        26   68   94
engineer         2   62   64
entertainment    2   16   18
executive        3   29   32
healthcare      10    5   15
homemaker        6    1    7
lawyer           2   10   12
librarian       28   22   50
marketing       10   16   26
other           34   69  103
programmer       6   58   64
retired          1   13   14
salesman         3    9   12
scientist        3   28   31
student         59  132  191
technician       1   25   26
unknown          0    2    2
writer          19   26   45
All            262  655  917

In [9]:
print(pd.pivot_table(df,index='occupation', columns='gender', values='age', aggfunc='max'))

gender            F     M
occupation
administrator  62.0  70.0
artist         48.0  45.0
doctor          NaN  64.0
educator       51.0  63.0
engineer       36.0  70.0
entertainment  38.0  50.0
executive      49.0  69.0
healthcare     53.0  62.0
homemaker      50.0  23.0
lawyer         51.0  53.0
librarian      59.0  69.0
marketing      50.0  55.0
other          55.0  64.0
programmer     38.0  63.0
retired        70.0  73.0
salesman       33.0  66.0
scientist      31.0  55.0
student        38.0  42.0
technician     38.0  55.0
unknown         NaN  24.0
writer         56.0  60.0